# SQL: consumo consultas mediante ***vistas***:

### Importación de librerías:

In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine

### Conexión con la base de datos:

In [2]:
my_pass = os.getenv("db_pass")
my_db = os.getenv("db_name")
my_user = os.getenv("db_user")

engine = create_engine(f"postgresql://{my_user}:{my_pass}@localhost:5432/{my_db}")

### Creación de consulta mediante **vista:**

In [3]:
query = """
    SELECT 
    nombre_estudiante,
    edad,
    correo_electronico,
    nombre_carrera,
    nombre_facultad,
    nombre_curso
    FROM vista_general
    WHERE
    nombre_carrera = 'Ingeniería Civil'
"""

### Creación de dataframe:

In [4]:
df_estudiantes_ing_civil = pd.read_sql(query, engine)
df_estudiantes_ing_civil.head(5)

,nombre_estudiante,edad,correo_electronico,nombre_carrera,nombre_facultad,nombre_curso
0,José López,29.0,jlopez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
1,Mariana Torres,24.0,mtorres2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
2,Francisco Gómez,27.0,fgomez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
3,Silvia Ramírez,29.0,sramirez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
4,Javier Vargas,28.0,jvargas2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas

In [5]:
df_estudiantes_ing_civil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   nombre_estudiante   15 non-null     object
 1   edad                15 non-null     float64
 2   correo_electronico  15 non-null     object
 3   nombre_carrera      15 non-null     object
 4   nombre_facultad     15 non-null     object
 5   nombre_curso        15 non-null     object
dtypes: float64(1), object(5)
memory usage: 852.0+ bytes